Revit 2024 API
FaceEdgeNode.GetFaceEdge Method
 Returns the Face edge object corresponding to the node.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020
Syntax
C#
public Edge GetFaceEdge()
Visual Basic
Public Function GetFaceEdge As Edge
Visual C++
public:
Edge^ GetFaceEdge()
Return Value
 The face edge.
See Also
FaceEdgeNode Class
Autodesk.Revit.DB Namespace